# ExportUrls Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions..::..ExportUrls Property
NavisworksExportOptions Class See Also
---
True to export URL parameters, false otherwise. Default value is true.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ExportUrls { get; set; }
```

Visual Basic
---
```text
Public Property ExportUrls As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ExportUrls {
	bool get ();
	void set (bool value);
}
```

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace